# BoundaryConditionAreaAndLineSymbolSpacing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSettings..::..BoundaryConditionAreaAndLineSymbolSpacing Property
StructuralSettings Class See Also
---
Symbol spacing for boundary conditions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double BoundaryConditionAreaAndLineSymbolSpacing { get; set; }
```

Visual Basic
---
```text
Public Property BoundaryConditionAreaAndLineSymbolSpacing As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BoundaryConditionAreaAndLineSymbolSpacing {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace